using System;

public enum 技能Enum{
    None,
    //星级
    英雄伤害,
    技能冷却缩减,
    击退距离,
    效果范围,
    瑶池减速效果,
    瑶池持续时间,
    龟丞相减速,
    射手箭矢数量,
    
    妲己效果,
    妲己持续时间,
    孙悟空挥棒次数,
    琼霄控制时长,
    羲和灼烧伤害,
    常羲减速,
    女娲效果,
    女娲持续时间,
    
    元始火种个数,
    火种旋转速度,
    玄冰风弹道速度减少,
    玄冰风每秒增长速度增加,
    无极天火数量,
    混沌开天拳出拳数量增加,
    
    //法则
    每次下场增加如意金箍棒伤害,
    连射概率,
    烈日灼心阵灼烧每次可叠加伤害,
    补天净化咒被施法英雄伤害增加,
    太清玄冰风增大速度增加,
    混沌开天拳每次出拳增加伤害,
    
    //神通
    神通冷却时间,
    神通伤害,
    神通能量,
    
    //辅助
    被辅助英雄伤害,
    被辅助英雄暴击率,
    被辅助英雄暴击伤害,
    被辅助英雄神通伤害,
    
    //新增
    技能伤害,
    
    射手分裂,
    射手穿透,
    射手距离越远伤害越高,
    ,
}
public class 英雄技能树Config
{
        
}
