using System;
using System.Collections.Generic;
using Config;
using UnityEngine;
using Random = UnityEngine.Random;

public enum 建筑Type
{
    None,
    矿场,
    玄铁洞,
    地脉,
    功德碑,
    聚贤阁,
    炼丹室,
    炼器室,
    领主府,
    坊市,
}


public enum 供奉品质Type
{
    None,
    凡,
    灵,
    仙,
    圣,
    道,
}

public class 建筑配置
{
    public int 等级;
    public float 数值;
    public float 升级需要灵气;
    public float 升级需要矿石;
    public float 升级需要玄铁;
    public float 升级需要玉髓;
}

public class 领主府配置
{
    public int 等级;
    public List<float> 招募概率列表;
    public int 供奉个数;
    public int 供奉保留个数;
    public int 供奉申请个数;
    public int 每道年供奉申请个数;
    public float 升级需要灵气;
    public float 升级需要矿石;
    public float 升级需要玄铁;
    public float 升级需要玉髓;
}

public class 炼丹炼器配置
{
    public int 等级;
    public QualityType 最高炼制QualityType;
    public float 速度加成;
    public float 升级需要灵气;
    public float 升级需要矿石;
    public float 升级需要玄铁;
    public float 升级需要玉髓;
}

public class 聚贤阁配置
{
    public int 等级;
    public List<float> 普通招募概率;
    public List<float> 高级招募概率;
    public float 升级需要灵气;
    public float 升级需要矿石;
    public float 升级需要玄铁;
    public float 升级需要玉髓;
}

public class 坊市配置
{
    public int 等级;
    public List<float> 概率;
    public float 升级需要灵气;
    public float 升级需要矿石;
    public float 升级需要玄铁;
    public float 升级需要玉髓;
}

public enum 供奉特性Type
{
    None,
    采矿速度,
    采铁速度,
    地脉产玉髓速度,
    功德产出速度,
    概率获得两个高级招募卷,
    概率增加炼丹数量,
    增加炼丹速度,
    增加炼丹经验,
    增加炼器速度,
    增加法器分解粉尘,
    坊市价格减少,
    获得矿石概率获得玄铁,
    获得矿石概率获得玉髓,
    获得玄铁概率获得矿石,
    获得玄铁概率获得玉髓,
    获得玉髓概率获得玄铁,
    获得玉髓概率获得矿石,
    坊市刷新概率不消耗次数,
}

public class 供奉特性
{
    public 供奉特性Type 供奉特性Type;
    public 供奉品质Type 供奉品质Type;
}

public class 供奉
{
    public 供奉品质Type 供奉品质Type;
    public string name;
    // 头像只存id，Sprite为运行时资源，不可序列化（Sprite.bounds.center.normalized 会导致 Newtonsoft 自引用循环）
    public int 头像id;
    [Newtonsoft.Json.JsonIgnore]
    public Sprite 供奉头像;
    public float 矿;
    public float 铁;
    public float 玉;
    public float 德;
    public float 贤;
    public float 器;
    public float 丹;
    public float 坊;
    public List<供奉特性> 特性list=new List<供奉特性>();
}
public class 道场Config
{
    public static Dictionary<供奉特性Type, List<float>> 供奉特性Dic = new Dictionary<供奉特性Type, List<float>>()
    {
        { 供奉特性Type.采矿速度 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.采铁速度 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.地脉产玉髓速度 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.功德产出速度 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.概率获得两个高级招募卷 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.概率增加炼丹数量 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.增加炼丹速度 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.增加炼丹经验 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.增加炼器速度 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.增加法器分解粉尘 ,new List<float>(){5,10,15,25,50} },
        { 供奉特性Type.坊市价格减少 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.获得矿石概率获得玄铁 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.获得矿石概率获得玉髓 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.获得玄铁概率获得矿石 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.获得玄铁概率获得玉髓 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.获得玉髓概率获得玄铁 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.获得玉髓概率获得矿石 ,new List<float>(){3,6,10,18,35} },
        { 供奉特性Type.坊市刷新概率不消耗次数 ,new List<float>(){3,6,10,18,35} },

    };

    public static Dictionary<供奉特性Type, string> 供奉特性名Dic = new Dictionary<供奉特性Type, string>()
    {
        { 供奉特性Type.采矿速度, "点石成金" },
        { 供奉特性Type.采铁速度, "玄铁生光" },
        { 供奉特性Type.地脉产玉髓速度, "地涌泉髓" },
        { 供奉特性Type.功德产出速度, "德被十方" },
        { 供奉特性Type.概率获得两个高级招募卷, "慧眼识珠" },
        { 供奉特性Type.概率增加炼丹数量, "一炉双丹" },
        { 供奉特性Type.增加炼丹速度, "炉火纯青" },
        { 供奉特性Type.增加炼丹经验, "丹成悟玄" },
        { 供奉特性Type.增加炼器速度, "欧冶铸锋" },
        { 供奉特性Type.增加法器分解粉尘, "返璞凝尘" },
        { 供奉特性Type.坊市价格减少, "广结善缘" },
        { 供奉特性Type.获得矿石概率获得玄铁, "璞里藏锋" },
        { 供奉特性Type.获得矿石概率获得玉髓, "石中孕玉" },
        { 供奉特性Type.获得玄铁概率获得矿石, "黑金怀璞" },
        { 供奉特性Type.获得玄铁概率获得玉髓, "寒铁生髓" },
        { 供奉特性Type.获得玉髓概率获得玄铁, "琼浆淬锋" },
        { 供奉特性Type.获得玉髓概率获得矿石, "玉液凝璞" },
        { 供奉特性Type.坊市刷新概率不消耗次数, "坊市门票" },

    };
    public static string Get领主数值string(建筑Type 建筑type)
    {
        switch (建筑type)
        {
            case 建筑Type.功德碑:
                return "德";
            case 建筑Type.玄铁洞:
                return "铁";
            case 建筑Type.矿场:
                return "矿";
            case 建筑Type.炼丹室:
                return "丹";
            case 建筑Type.炼器室:
                return "器";
            case 建筑Type.坊市:
                return "坊";
            case 建筑Type.地脉:
                return "玉";
            case 建筑Type.聚贤阁:
                return "贤";
        }

        return "";
    }
    public static List<string> 女供奉名List = new List<string>()
    {
        // ===== 两字名 80 个（姓氏互不相同，名中用字互不相同）=====
        "赵瑶","钱凝","孙霜","李月","周雪","吴烟","郑若","王灵","冯薇","陈岚",
        "褚婉","卫嫣","蒋婵","沈萱","韩芷","杨菲","朱菡","秦菱","尤芙","许蕙",
        "何兰","吕柔","施筠","张梦","孔幻","曹影","严舞","华弦","金琴","魏瑟",
        "陶锦","姜钰","戚珊","谢琼","邹瑜","喻瑾","柏琳","窦璇","章璐","云翠",
        "潘碧","葛丹","奚彤","范绯","彭紫","郎绾","鲁绮","韦绫","马素","苗裳",
        "凤音","花兮","方卿","俞娥","任姬","袁嫱","柳宓","鲍婠","史姮","唐姣",
        "费娆","岑娉","薛娜","雷妍","贺妤","倪葭","汤荻","罗萤","毕苒","郝蓓",
        "安萸","常蓁","傅荞","齐苓","康茉","伍茜","余茴","顾芮","孟芸","黄蕊",

        // ===== 三字名 180 个（姓氏与两字名完全不重叠，双字名两两不同，杜绝只改姓氏的近名）=====
        "苏清璃","林若瑶","徐语嫣","胡婉宁","高凝霜","董沐雪","梁芷烟","萧灵薇","程月婵","宋梦萱",
        "叶菡菲","白菱歌","江芙蕖","童蕙心","颜兰音","郭柔嘉","梅筠溪","钟幻瞳","骆影怜","夏舞雩",
        "蔡弦思","田锦瑟","樊钰笺","凌珊枕","霍琼枝","虞瑜佩","万琳阙","柯璇枢","管璐嫔","卢翠翘",
        "莫碧城","房丹丘","丁彤管","邓绯衣","郁紫萸","单绾发","杭绮疏","洪绫纨","包素笺","左霓裳",
        "石卿尘","崔娥皇","吉姬冰","龚嫱照","裴婠妠","陆嫦曦","荣姣澜","翁娆珠","荀娉婷","羊娜嬛",
        "惠妍姿","甄妤暻","封葭露","芮荻花","储萤火","靳苒迟","松蓓蕾","井蓁眠","段苓茏","富茉离",
        "巫茜绡","乌茴珍","焦韫瑄","巴芸帙","牧蕊宫","山晓镜","谷雅韵","车静姝","侯淑慎","宓慧黠",
        "蓬敏之","全秀靥","班涓漪","仰瑛珞","秋佩玖","仲璧人","伊青鸾","宫寒冰","宁霁川","仇泠泷",
        "栾秋暝","暴春葱","甘夏荷","厉冬梅","戎朝槿","祖暮霞","武星阑","符辰砂","刘雨桐","景露晞",
        "詹雾縠","龙虹采","幸霓旌","司晴岚","韶曦和","黎晗祯","薄昕夕","宿映波","怀晚棠","蒲晨檀",
        "从妙鬘","鄂弄玉","索书鸢","咸画屏","赖诗痕","卓茗兮","蔺酿桃","屠酥娘","蒙筝柱","池笛舟",
        "乔箫声","阴铃络","胥钗凤","苍钿合","双玑衡","闻玳瑁","莘玛瑙","党璎珞","翟琼琚","谭瑶轸",
        "贡绿萼","劳红袖","逄绛唇","姬缃桃","申缇幕","扶纨扇","堵绣帘","冉罗襦","宰锦茵","郦桂魄",
        "雍桃夭","郤柳絮","桑榆景","桂槐安","濮枫落","牛樨香","寿橘颂","通梅子","边梨涡","扈杏梁",
        "燕芍药","冀荼蘼","郏蔷薇","浦茑萝","尚蘅芜","农幽兰","温潇湘","别洛滨","庄渭塘","晏瀚海",
        "柴琥珀","瞿翡翠","阎鸣珂","充玲珑","慕琅玕","连玫瑰","茹玉笙","习金缕","宦银潢","艾铜雀",
        "鱼昭训","容令仪","向幼微","古玄机","易红拂","慎朝云","戈夜来","廖小蛮","庾真真","终莺时",
        "居燕归","衡惊鸿","步游龙","都流风","耿神光","满翩跹","弘绰约","匡缥缈","国妩媚","文嫣然",

        // ===== 四字名 40 个（40 个不同复姓，双字名两两不同）=====
        "欧阳婉清","太史淑窈","端木慧君","上官静娴","司马令月","东方嘉柔","独孤其华","南宫霏霏","万俟零露","闻人清扬",
        "夏侯静好","诸葛烟萝","尉迟鸣佩","公羊珊珊","赫连悠然","澹台盈袖","皇甫纤秾","宗政纤阿","濮阳袅晴","公冶依人",
        "太叔如雪","申屠玉润","公孙珠圆","慕容金声","仲孙鸾回","钟离凤翥","长孙鸿渐","宇文关雎","司空窈窕","鲜于幽闲",
        "闾丘贞静","亓官端庄","司寇惠和","巫马柔顺","公西庄敬","颛孙懿德","壤驷徽音","公良令淑","漆雕芳若","乐正芬馨",
    };
    public static Dictionary<int, 聚贤阁配置> 聚贤阁配置 = new Dictionary<int, 聚贤阁配置>()
    {
        {1,new 聚贤阁配置(){等级=1,普通招募概率 = new List<float>(){80,20,0,0,0,0,0,0},高级招募概率 = new List<float>(){0,0,80,20,0,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 1000,升级需要玉髓 = 1000,升级需要矿石 = 1000}},
        {2,new 聚贤阁配置(){等级=2,普通招募概率 = new List<float>(){50,50,0,0,0,0,0,0},高级招募概率 = new List<float>(){0,0,50,50,0,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 8000,升级需要玉髓 = 8000,升级需要矿石 = 8000}},
        {3,new 聚贤阁配置(){等级=3,普通招募概率 = new List<float>(){15,70,15,0,0,0,0,0},高级招募概率 = new List<float>(){0,0,15,70,15,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 50000,升级需要玉髓 = 50000,升级需要矿石 = 50000}},
        {4,new 聚贤阁配置(){等级=4,普通招募概率 = new List<float>(){0,70,30,0,0,0,0,0},高级招募概率 = new List<float>(){0,0,0,70,30,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 500000,升级需要玉髓 = 500000,升级需要矿石 = 500000}},
        {5,new 聚贤阁配置(){等级=5,普通招募概率 = new List<float>(){0,45,45,10,0,0,0,0},高级招募概率 = new List<float>(){0,0,0,45,45,10,0,0},升级需要灵气 = 0,升级需要玄铁 = 3000000,升级需要玉髓 = 3000000,升级需要矿石 = 3000000}},
        {6,new 聚贤阁配置(){等级=6,普通招募概率 = new List<float>(){0,20,60,20,0,0,0,0},高级招募概率 = new List<float>(){0,0,0,20,60,20,0,0},升级需要灵气 = 0,升级需要玄铁 = 20000000,升级需要玉髓 = 20000000,升级需要矿石 = 20000000}},
        {7,new 聚贤阁配置(){等级=7,普通招募概率 = new List<float>(){0,0,65,30,5,0,0,0},高级招募概率 = new List<float>(){0,0,0,0,65,30,5,0},升级需要灵气 = 0,升级需要玄铁 = 100000000,升级需要玉髓 = 100000000,升级需要矿石 = 100000000}},
        {8,new 聚贤阁配置(){等级=8,普通招募概率 = new List<float>(){0,0,40,50,10,0,0,0},高级招募概率 = new List<float>(){0,0,0,0,40,50,10,0},升级需要灵气 = 0,升级需要玄铁 = 500000000,升级需要玉髓 = 500000000,升级需要矿石 = 500000000}},
        {9,new 聚贤阁配置(){等级=9,普通招募概率 = new List<float>(){0,0,0,82,15,3,0,0},高级招募概率 = new List<float>(){80,20,0,0,15,70,15,0},升级需要灵气 = 0,升级需要玄铁 = 3000000000,升级需要玉髓 = 3000000000,升级需要矿石 = 3000000000}},
        {10,new 聚贤阁配置(){等级=10,普通招募概率 = new List<float>(){0,0,0,70,25,5,0,0},高级招募概率 = new List<float>(){0,0,0,0,0,79,20,1},升级需要灵气 = 0,升级需要玄铁 = 30000000000,升级需要玉髓 = 30000000000,升级需要矿石 = 30000000000}},

    };
    public static Dictionary<int, 坊市配置> 坊市配置 = new Dictionary<int, 坊市配置>()
    {
        {1,new 坊市配置(){等级=1,概率 = new List<float>(){0,0,80,20,0,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 1000,升级需要玉髓 = 0,升级需要矿石 = 1000}},
        {2,new 坊市配置(){等级=2,概率 = new List<float>(){0,0,50,50,0,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 8000,升级需要玉髓 = 0,升级需要矿石 = 8000}},
        {3,new 坊市配置(){等级=3,概率 = new List<float>(){0,0,15,70,15,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 50000,升级需要玉髓 = 0,升级需要矿石 = 50000}},
        {4,new 坊市配置(){等级=4,概率 = new List<float>(){0,0,0,70,30,0,0,0},升级需要灵气 = 0,升级需要玄铁 = 500000,升级需要玉髓 = 0,升级需要矿石 = 500000}},
        {5,new 坊市配置(){等级=5,概率 = new List<float>(){0,0,0,45,45,10,0,0},升级需要灵气 = 0,升级需要玄铁 = 3000000,升级需要玉髓 = 0,升级需要矿石 = 3000000}},
        {6,new 坊市配置(){等级=6,概率 = new List<float>(){0,0,0,20,60,20,0,0},升级需要灵气 = 0,升级需要玄铁 = 20000000,升级需要玉髓 = 0,升级需要矿石 = 20000000}},
        {7,new 坊市配置(){等级=7,概率 = new List<float>(){0,0,0,0,65,30,5,0},升级需要灵气 = 0,升级需要玄铁 = 100000000,升级需要玉髓 = 0,升级需要矿石 = 100000000}},
        {8,new 坊市配置(){等级=8,概率 = new List<float>(){0,0,0,0,40,50,10,0},升级需要灵气 = 0,升级需要玄铁 = 500000000,升级需要玉髓 = 0,升级需要矿石 = 500000000}},
        {9,new 坊市配置(){等级=9,概率 = new List<float>(){80,20,0,0,15,70,15,0},升级需要灵气 = 0,升级需要玄铁 = 3000000000,升级需要玉髓 = 0,升级需要矿石 = 3000000000}},
        {10,new 坊市配置(){等级=10,概率 = new List<float>(){0,0,0,0,0,79,20,1},升级需要灵气 = 0,升级需要玄铁 = 15000000000,升级需要玉髓 = 0,升级需要矿石 = 15000000000}},
    };

    public static Dictionary<供奉品质Type, minmax> 供奉数值范围 = new Dictionary<供奉品质Type, minmax>()
    {
        { 供奉品质Type.凡, new minmax() { min = 3, max = 8 } },
        { 供奉品质Type.灵, new minmax() { min = 5, max = 15 } },
        { 供奉品质Type.仙, new minmax() { min = 10, max = 30 } },
        { 供奉品质Type.圣, new minmax() { min = 20, max = 50 } },
        { 供奉品质Type.道, new minmax() { min = 40, max = 100 } },
    };

    public static Dictionary<供奉品质Type, float> 供奉特性概率 = new Dictionary<供奉品质Type, float>()
    {
        { 供奉品质Type.凡, 2 },
        { 供奉品质Type.灵, 4 },
        { 供奉品质Type.仙, 8 },
        { 供奉品质Type.圣, 16 },
        { 供奉品质Type.道, 30 },
    };

    public static List<供奉> Get每道年供奉申请列表()
    {
        List<供奉> list = new List<供奉>();
        List<float> 品质概率list = 领主府配置[PlayerData.S.建筑等级Dic[建筑Type.领主府]].招募概率列表;
        for (int i = 0; i<领主府配置[PlayerData.S.建筑等级Dic[建筑Type.领主府]].每道年供奉申请个数; i++)
        {
            float random = Random.Range(0, 100f);
            float count = 0;
            int index = 0;
            foreach (var item in 品质概率list)
            {
                count += item;
                if (random <= count)
                {
                    break;
                }
                index++;
            }

            供奉品质Type 供奉品质Type = (供奉品质Type)(index + 1);
            list.Add(Get品质供奉(供奉品质Type));
        }

        return list;
    }
    public static 供奉 Get品质供奉(供奉品质Type type)
    {
        供奉 供奉 = new 供奉();
        供奉.供奉品质Type = type;
        供奉.name = 女供奉名List[Random.Range(0, 女供奉名List.Count)];
        供奉.头像id = Random.Range(1, 31);
        供奉.供奉头像 = ResourcesConfig.Get女供奉Sprite(供奉.头像id);
        供奉.矿 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.器 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.铁 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.玉 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.贤 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.德 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.丹 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        供奉.坊 = Random.Range(供奉数值范围[type].min, 供奉数值范围[type].max + 1);
        for (int i = 0; i < 4; i++)
        {
            float random = Random.Range(0, 100);
            if (random < 供奉特性概率[type])
            {
                供奉.特性list.Add(Get品质供奉特性(type));
            }
        }
        return 供奉;
    }

    public static 供奉特性 Get品质供奉特性(供奉品质Type type)
    {
        供奉特性 供奉特性 = new 供奉特性();
        供奉特性.供奉品质Type = type;
        供奉特性.供奉特性Type = (供奉特性Type)Random.Range(0, Enum.GetValues(typeof(供奉特性Type)).Length);
        return 供奉特性;
    }

    /// <summary>
    /// 读档后按 头像id 还原 Sprite；老存档无id（=0）时随机补一个
    /// </summary>
    public static void 还原供奉头像(供奉 供奉)
    {
        if (供奉.头像id <= 0)
        {
            供奉.头像id = Random.Range(1, 31);
        }
        供奉.供奉头像 = ResourcesConfig.Get女供奉Sprite(供奉.头像id);
    }
    public static Dictionary<int, 领主府配置> 领主府配置 = new Dictionary<int, 领主府配置>()
    {
        {1,new 领主府配置(){等级=1,招募概率列表 = new List<float>(){80,20,0,0,0},供奉个数 = 1,每道年供奉申请个数=1,供奉申请个数 = 5,供奉保留个数 = 1,升级需要灵气 = 2000,升级需要玄铁 = 1000,升级需要玉髓 = 1000,升级需要矿石 = 1000}},
        {2,new 领主府配置(){等级=2,招募概率列表 = new List<float>(){50,50,0,0,0},供奉个数 = 2,每道年供奉申请个数=2,供奉申请个数 = 7,供奉保留个数 = 2,升级需要灵气 = 10000,升级需要玄铁 = 8000,升级需要玉髓 = 8000,升级需要矿石 = 8000}},
        {3,new 领主府配置(){等级=3,招募概率列表 = new List<float>(){15,70,15,0,0},供奉个数 = 3,每道年供奉申请个数=3,供奉申请个数 = 9,供奉保留个数 = 3,升级需要灵气 = 40000,升级需要玄铁 = 50000,升级需要玉髓 = 50000,升级需要矿石 = 50000}},
        {4,new 领主府配置(){等级=4,招募概率列表 = new List<float>(){0,70,30,0,0},供奉个数 = 4,每道年供奉申请个数=4,供奉申请个数 = 11,供奉保留个数 = 4,升级需要灵气 = 200000,升级需要玄铁 = 500000,升级需要玉髓 = 500000,升级需要矿石 = 500000}},
        {5,new 领主府配置(){等级=5,招募概率列表 = new List<float>(){0,50,50,0,0},供奉个数 = 5,每道年供奉申请个数=5,供奉申请个数 = 13,供奉保留个数 = 5,升级需要灵气 = 800000,升级需要玄铁 = 3000000,升级需要玉髓 = 3000000,升级需要矿石 = 3000000}},
        {6,new 领主府配置(){等级=6,招募概率列表 = new List<float>(){0,20,70,10,0},供奉个数 = 6,每道年供奉申请个数=6,供奉申请个数 = 15,供奉保留个数 = 6,升级需要灵气 = 2000000,升级需要玄铁 = 20000000,升级需要玉髓 = 20000000,升级需要矿石 = 20000000}},
        {7,new 领主府配置(){等级=7,招募概率列表 = new List<float>(){0,0,80,20,0},供奉个数 = 7,每道年供奉申请个数=7,供奉申请个数 = 18,供奉保留个数 = 7,升级需要灵气 = 5000000,升级需要玄铁 = 100000000,升级需要玉髓 = 100000000,升级需要矿石 = 100000000}},
        {8,new 领主府配置(){等级=8,招募概率列表 = new List<float>(){0,0,70,30,0},供奉个数 = 8,每道年供奉申请个数=8,供奉申请个数 = 21,供奉保留个数 = 8,升级需要灵气 = 15000000,升级需要玄铁 = 500000000,升级需要玉髓 = 500000000,升级需要矿石 = 500000000}},
        {9,new 领主府配置(){等级=9,招募概率列表 = new List<float>(){0,0,55,40,5},供奉个数 = 9,每道年供奉申请个数=9,供奉申请个数 = 24,供奉保留个数 = 9,升级需要灵气 = 50000000,升级需要玄铁 = 3000000000,升级需要玉髓 = 3000000000,升级需要矿石 = 3000000000}},
        {10,new 领主府配置(){等级=10,招募概率列表 = new List<float>(){0,0,40,50,10},供奉个数 = 10,每道年供奉申请个数=10,供奉申请个数 = 28,供奉保留个数 = 10,升级需要灵气 = 200000000,升级需要玄铁 = 15000000000,升级需要玉髓 = 15000000000,升级需要矿石 = 15000000000}},

    };
    public static Dictionary<int, 炼丹炼器配置> 炼丹室配置 = new Dictionary<int, 炼丹炼器配置>()
    {
        {1,new 炼丹炼器配置(){等级=1,最高炼制QualityType = QualityType.玄品,速度加成 = 0,升级需要灵气 = 0,升级需要玄铁 = 1000,升级需要玉髓 = 1000,升级需要矿石 = 0}},
        {2,new 炼丹炼器配置(){等级=2,最高炼制QualityType = QualityType.地品,速度加成 = 10,升级需要灵气 = 0,升级需要玄铁 = 8000,升级需要玉髓 = 8000,升级需要矿石 = 0}},
        {3,new 炼丹炼器配置(){等级=3,最高炼制QualityType = QualityType.地品,速度加成 = 20,升级需要灵气 = 0,升级需要玄铁 = 50000,升级需要玉髓 = 50000,升级需要矿石 = 0}},
        {4,new 炼丹炼器配置(){等级=4,最高炼制QualityType = QualityType.宇品,速度加成 = 40,升级需要灵气 = 0,升级需要玄铁 = 500000,升级需要玉髓 = 500000,升级需要矿石 = 0}},
        {5,new 炼丹炼器配置(){等级=5,最高炼制QualityType = QualityType.宇品,速度加成 = 70,升级需要灵气 = 0,升级需要玄铁 = 3000000,升级需要玉髓 = 3000000,升级需要矿石 = 0}},
        {6,new 炼丹炼器配置(){等级=6,最高炼制QualityType = QualityType.宙品,速度加成 = 120,升级需要灵气 = 0,升级需要玄铁 = 20000000,升级需要玉髓 = 20000000,升级需要矿石 = 0}},
        {7,new 炼丹炼器配置(){等级=7,最高炼制QualityType = QualityType.宙品,速度加成 = 200,升级需要灵气 = 0,升级需要玄铁 = 100000000,升级需要玉髓 = 100000000,升级需要矿石 = 0}},
        {8,new 炼丹炼器配置(){等级=8,最高炼制QualityType = QualityType.洪品,速度加成 = 300,升级需要灵气 = 0,升级需要玄铁 = 500000000,升级需要玉髓 = 500000000,升级需要矿石 = 0}},
        {9,new 炼丹炼器配置(){等级=9,最高炼制QualityType = QualityType.洪品,速度加成 = 500,升级需要灵气 = 0,升级需要玄铁 = 3000000000,升级需要玉髓 = 3000000000,升级需要矿石 = 0}},
        {10,new 炼丹炼器配置(){等级=10,最高炼制QualityType = QualityType.荒品,速度加成 = 1000,升级需要灵气 = 0,升级需要玄铁 = 15000000000,升级需要玉髓 = 15000000000,升级需要矿石 = 0}},
    };
    
    public static Dictionary<int, 炼丹炼器配置> 炼器室配置 = new Dictionary<int, 炼丹炼器配置>()
    {
        {1,new 炼丹炼器配置(){等级=1,最高炼制QualityType = QualityType.玄品,速度加成 = 0,升级需要灵气 = 0,升级需要矿石 = 1000,升级需要玉髓 = 1000,升级需要玄铁 = 0}},
        {2,new 炼丹炼器配置(){等级=2,最高炼制QualityType = QualityType.地品,速度加成 = 10,升级需要灵气 = 0,升级需要矿石 = 8000,升级需要玉髓 = 8000,升级需要玄铁 = 0}},
        {3,new 炼丹炼器配置(){等级=3,最高炼制QualityType = QualityType.地品,速度加成 = 20,升级需要灵气 = 0,升级需要矿石 = 50000,升级需要玉髓 = 50000,升级需要玄铁 = 0}},
        {4,new 炼丹炼器配置(){等级=4,最高炼制QualityType = QualityType.宇品,速度加成 = 40,升级需要灵气 = 0,升级需要矿石 = 500000,升级需要玉髓 = 500000,升级需要玄铁 = 0}},
        {5,new 炼丹炼器配置(){等级=5,最高炼制QualityType = QualityType.宇品,速度加成 = 70,升级需要灵气 = 0,升级需要矿石 = 3000000,升级需要玉髓 = 3000000,升级需要玄铁 = 0}},
        {6,new 炼丹炼器配置(){等级=6,最高炼制QualityType = QualityType.宙品,速度加成 = 120,升级需要灵气 = 0,升级需要矿石 = 20000000,升级需要玉髓 = 20000000,升级需要玄铁 = 0}},
        {7,new 炼丹炼器配置(){等级=7,最高炼制QualityType = QualityType.宙品,速度加成 = 200,升级需要灵气 = 0,升级需要矿石 = 100000000,升级需要玉髓 = 100000000,升级需要玄铁 = 0}},
        {8,new 炼丹炼器配置(){等级=8,最高炼制QualityType = QualityType.洪品,速度加成 = 300,升级需要灵气 = 0,升级需要矿石 = 500000000,升级需要玉髓 = 500000000,升级需要玄铁 = 0}},
        {9,new 炼丹炼器配置(){等级=9,最高炼制QualityType = QualityType.洪品,速度加成 = 500,升级需要灵气 = 0,升级需要矿石 = 3000000000,升级需要玉髓 = 3000000000,升级需要玄铁 = 0}},
        {10,new 炼丹炼器配置(){等级=10,最高炼制QualityType = QualityType.荒品,速度加成 = 1000,升级需要灵气 = 0,升级需要矿石 = 15000000000,升级需要玉髓 = 15000000000,升级需要玄铁 = 0}},

    };
    public static Dictionary<int, 建筑配置> 矿场配置 = new Dictionary<int, 建筑配置>()
    {
        { 1, new 建筑配置() { 等级 = 1, 数值 = 100, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 2, new 建筑配置() { 等级 = 2, 数值 = 120, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 3, new 建筑配置() { 等级 = 3, 数值 = 140, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 4, new 建筑配置() { 等级 = 4, 数值 = 160, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 5, new 建筑配置() { 等级 = 5, 数值 = 180, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 6, new 建筑配置() { 等级 = 6, 数值 = 200, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 7, new 建筑配置() { 等级 = 7, 数值 = 220, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 8, new 建筑配置() { 等级 = 8, 数值 = 240, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 9, new 建筑配置() { 等级 = 9, 数值 = 260, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 10, new 建筑配置() { 等级 = 10, 数值 = 280, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 11, new 建筑配置() { 等级 = 11, 数值 = 320, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 12, new 建筑配置() { 等级 = 12, 数值 = 360, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 13, new 建筑配置() { 等级 = 13, 数值 = 400, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 14, new 建筑配置() { 等级 = 14, 数值 = 440, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 15, new 建筑配置() { 等级 = 15, 数值 = 480, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 16, new 建筑配置() { 等级 = 16, 数值 = 520, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 17, new 建筑配置() { 等级 = 17, 数值 = 560, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 18, new 建筑配置() { 等级 = 18, 数值 = 600, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 19, new 建筑配置() { 等级 = 19, 数值 = 640, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 20, new 建筑配置() { 等级 = 20, 数值 = 680, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 21, new 建筑配置() { 等级 = 21, 数值 = 760, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 22, new 建筑配置() { 等级 = 22, 数值 = 840, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 23, new 建筑配置() { 等级 = 23, 数值 = 920, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 24, new 建筑配置() { 等级 = 24, 数值 = 1000, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 25, new 建筑配置() { 等级 = 25, 数值 = 1080, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 26, new 建筑配置() { 等级 = 26, 数值 = 1160, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 27, new 建筑配置() { 等级 = 27, 数值 = 1240, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 28, new 建筑配置() { 等级 = 28, 数值 = 1320, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 29, new 建筑配置() { 等级 = 29, 数值 = 1400, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 30, new 建筑配置() { 等级 = 30, 数值 = 1480, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 31, new 建筑配置() { 等级 = 31, 数值 = 1700, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 32, new 建筑配置() { 等级 = 32, 数值 = 1900, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 33, new 建筑配置() { 等级 = 33, 数值 = 2100, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 34, new 建筑配置() { 等级 = 34, 数值 = 2300, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 35, new 建筑配置() { 等级 = 35, 数值 = 2500, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 36, new 建筑配置() { 等级 = 36, 数值 = 2700, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 37, new 建筑配置() { 等级 = 37, 数值 = 2900, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 38, new 建筑配置() { 等级 = 38, 数值 = 3100, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 39, new 建筑配置() { 等级 = 39, 数值 = 3300, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 40, new 建筑配置() { 等级 = 40, 数值 = 3500, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 41, new 建筑配置() { 等级 = 41, 数值 = 3900, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 42, new 建筑配置() { 等级 = 42, 数值 = 4300, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 43, new 建筑配置() { 等级 = 43, 数值 = 4700, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 44, new 建筑配置() { 等级 = 44, 数值 = 5100, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 45, new 建筑配置() { 等级 = 45, 数值 = 5500, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 46, new 建筑配置() { 等级 = 46, 数值 = 5900, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 47, new 建筑配置() { 等级 = 47, 数值 = 6300, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 48, new 建筑配置() { 等级 = 48, 数值 = 6700, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 49, new 建筑配置() { 等级 = 49, 数值 = 7100, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 50, new 建筑配置() { 等级 = 50, 数值 = 7500, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 51, new 建筑配置() { 等级 = 51, 数值 = 8300, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 52, new 建筑配置() { 等级 = 52, 数值 = 9100, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 53, new 建筑配置() { 等级 = 53, 数值 = 9900, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 54, new 建筑配置() { 等级 = 54, 数值 = 10700, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 55, new 建筑配置() { 等级 = 55, 数值 = 11500, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 56, new 建筑配置() { 等级 = 56, 数值 = 12300, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 57, new 建筑配置() { 等级 = 57, 数值 = 13100, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 58, new 建筑配置() { 等级 = 58, 数值 = 13900, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 59, new 建筑配置() { 等级 = 59, 数值 = 14700, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 60, new 建筑配置() { 等级 = 60, 数值 = 15500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 61, new 建筑配置() { 等级 = 61, 数值 = 17500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 62, new 建筑配置() { 等级 = 62, 数值 = 19500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 63, new 建筑配置() { 等级 = 63, 数值 = 21500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 64, new 建筑配置() { 等级 = 64, 数值 = 23500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 65, new 建筑配置() { 等级 = 65, 数值 = 25500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 66, new 建筑配置() { 等级 = 66, 数值 = 27500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 67, new 建筑配置() { 等级 = 67, 数值 = 29500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 68, new 建筑配置() { 等级 = 68, 数值 = 31500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 69, new 建筑配置() { 等级 = 69, 数值 = 33500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 70, new 建筑配置() { 等级 = 70, 数值 = 35500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 71, new 建筑配置() { 等级 = 71, 数值 = 39500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 72, new 建筑配置() { 等级 = 72, 数值 = 43500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 73, new 建筑配置() { 等级 = 73, 数值 = 47500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 74, new 建筑配置() { 等级 = 74, 数值 = 51500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 75, new 建筑配置() { 等级 = 75, 数值 = 55500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 76, new 建筑配置() { 等级 = 76, 数值 = 59500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 77, new 建筑配置() { 等级 = 77, 数值 = 63500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 78, new 建筑配置() { 等级 = 78, 数值 = 67500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 79, new 建筑配置() { 等级 = 79, 数值 = 71500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 80, new 建筑配置() { 等级 = 80, 数值 = 75500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 81, new 建筑配置() { 等级 = 81, 数值 = 85500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 82, new 建筑配置() { 等级 = 82, 数值 = 95500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 83, new 建筑配置() { 等级 = 83, 数值 = 105500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 84, new 建筑配置() { 等级 = 84, 数值 = 115500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 85, new 建筑配置() { 等级 = 85, 数值 = 125500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 86, new 建筑配置() { 等级 = 86, 数值 = 135500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 87, new 建筑配置() { 等级 = 87, 数值 = 145500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 88, new 建筑配置() { 等级 = 88, 数值 = 155500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 89, new 建筑配置() { 等级 = 89, 数值 = 165500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 90, new 建筑配置() { 等级 = 90, 数值 = 175500, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 91, new 建筑配置() { 等级 = 91, 数值 = 210000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 92, new 建筑配置() { 等级 = 92, 数值 = 240000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 93, new 建筑配置() { 等级 = 93, 数值 = 270000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 94, new 建筑配置() { 等级 = 94, 数值 = 300000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 95, new 建筑配置() { 等级 = 95, 数值 = 330000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 96, new 建筑配置() { 等级 = 96, 数值 = 360000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 97, new 建筑配置() { 等级 = 97, 数值 = 390000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 98, new 建筑配置() { 等级 = 98, 数值 = 420000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 99, new 建筑配置() { 等级 = 99, 数值 = 450000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 100, new 建筑配置() { 等级 = 100, 数值 = 480000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 101, new 建筑配置() { 等级 = 101, 数值 = 580000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 102, new 建筑配置() { 等级 = 102, 数值 = 680000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 103, new 建筑配置() { 等级 = 103, 数值 = 780000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 104, new 建筑配置() { 等级 = 104, 数值 = 880000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 105, new 建筑配置() { 等级 = 105, 数值 = 980000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 106, new 建筑配置() { 等级 = 106, 数值 = 1080000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 107, new 建筑配置() { 等级 = 107, 数值 = 1180000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 108, new 建筑配置() { 等级 = 108, 数值 = 1280000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 109, new 建筑配置() { 等级 = 109, 数值 = 1380000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 110, new 建筑配置() { 等级 = 110, 数值 = 1700000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 111, new 建筑配置() { 等级 = 111, 数值 = 2000000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 112, new 建筑配置() { 等级 = 112, 数值 = 2300000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 113, new 建筑配置() { 等级 = 113, 数值 = 2600000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 114, new 建筑配置() { 等级 = 114, 数值 = 2900000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 115, new 建筑配置() { 等级 = 115, 数值 = 3200000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 116, new 建筑配置() { 等级 = 116, 数值 = 3500000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 117, new 建筑配置() { 等级 = 117, 数值 = 3800000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 118, new 建筑配置() { 等级 = 118, 数值 = 4100000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 119, new 建筑配置() { 等级 = 119, 数值 = 4400000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 120, new 建筑配置() { 等级 = 120, 数值 = 4700000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
    };
    
     public static Dictionary<int, 建筑配置> 玄铁洞配置 = new Dictionary<int, 建筑配置>()
    {
        { 1, new 建筑配置() { 等级 = 1, 数值 = 100, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 2, new 建筑配置() { 等级 = 2, 数值 = 120, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 3, new 建筑配置() { 等级 = 3, 数值 = 140, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 4, new 建筑配置() { 等级 = 4, 数值 = 160, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 5, new 建筑配置() { 等级 = 5, 数值 = 180, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 6, new 建筑配置() { 等级 = 6, 数值 = 200, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 7, new 建筑配置() { 等级 = 7, 数值 = 220, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 8, new 建筑配置() { 等级 = 8, 数值 = 240, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 9, new 建筑配置() { 等级 = 9, 数值 = 260, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 10, new 建筑配置() { 等级 = 10, 数值 = 280, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 11, new 建筑配置() { 等级 = 11, 数值 = 320, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 12, new 建筑配置() { 等级 = 12, 数值 = 360, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 13, new 建筑配置() { 等级 = 13, 数值 = 400, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 14, new 建筑配置() { 等级 = 14, 数值 = 440, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 15, new 建筑配置() { 等级 = 15, 数值 = 480, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 16, new 建筑配置() { 等级 = 16, 数值 = 520, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 17, new 建筑配置() { 等级 = 17, 数值 = 560, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 18, new 建筑配置() { 等级 = 18, 数值 = 600, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 19, new 建筑配置() { 等级 = 19, 数值 = 640, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 20, new 建筑配置() { 等级 = 20, 数值 = 680, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 21, new 建筑配置() { 等级 = 21, 数值 = 760, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 22, new 建筑配置() { 等级 = 22, 数值 = 840, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 23, new 建筑配置() { 等级 = 23, 数值 = 920, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 24, new 建筑配置() { 等级 = 24, 数值 = 1000, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 25, new 建筑配置() { 等级 = 25, 数值 = 1080, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 26, new 建筑配置() { 等级 = 26, 数值 = 1160, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 27, new 建筑配置() { 等级 = 27, 数值 = 1240, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 28, new 建筑配置() { 等级 = 28, 数值 = 1320, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 29, new 建筑配置() { 等级 = 29, 数值 = 1400, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 30, new 建筑配置() { 等级 = 30, 数值 = 1480, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 31, new 建筑配置() { 等级 = 31, 数值 = 1700, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 32, new 建筑配置() { 等级 = 32, 数值 = 1900, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 33, new 建筑配置() { 等级 = 33, 数值 = 2100, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 34, new 建筑配置() { 等级 = 34, 数值 = 2300, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 35, new 建筑配置() { 等级 = 35, 数值 = 2500, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 36, new 建筑配置() { 等级 = 36, 数值 = 2700, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 37, new 建筑配置() { 等级 = 37, 数值 = 2900, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 38, new 建筑配置() { 等级 = 38, 数值 = 3100, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 39, new 建筑配置() { 等级 = 39, 数值 = 3300, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 40, new 建筑配置() { 等级 = 40, 数值 = 3500, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 41, new 建筑配置() { 等级 = 41, 数值 = 3900, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 42, new 建筑配置() { 等级 = 42, 数值 = 4300, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 43, new 建筑配置() { 等级 = 43, 数值 = 4700, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 44, new 建筑配置() { 等级 = 44, 数值 = 5100, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 45, new 建筑配置() { 等级 = 45, 数值 = 5500, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 46, new 建筑配置() { 等级 = 46, 数值 = 5900, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 47, new 建筑配置() { 等级 = 47, 数值 = 6300, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 48, new 建筑配置() { 等级 = 48, 数值 = 6700, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 49, new 建筑配置() { 等级 = 49, 数值 = 7100, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 50, new 建筑配置() { 等级 = 50, 数值 = 7500, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 51, new 建筑配置() { 等级 = 51, 数值 = 8300, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 52, new 建筑配置() { 等级 = 52, 数值 = 9100, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 53, new 建筑配置() { 等级 = 53, 数值 = 9900, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 54, new 建筑配置() { 等级 = 54, 数值 = 10700, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 55, new 建筑配置() { 等级 = 55, 数值 = 11500, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 56, new 建筑配置() { 等级 = 56, 数值 = 12300, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 57, new 建筑配置() { 等级 = 57, 数值 = 13100, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 58, new 建筑配置() { 等级 = 58, 数值 = 13900, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 59, new 建筑配置() { 等级 = 59, 数值 = 14700, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 60, new 建筑配置() { 等级 = 60, 数值 = 15500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 61, new 建筑配置() { 等级 = 61, 数值 = 17500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 62, new 建筑配置() { 等级 = 62, 数值 = 19500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 63, new 建筑配置() { 等级 = 63, 数值 = 21500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 64, new 建筑配置() { 等级 = 64, 数值 = 23500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 65, new 建筑配置() { 等级 = 65, 数值 = 25500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 66, new 建筑配置() { 等级 = 66, 数值 = 27500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 67, new 建筑配置() { 等级 = 67, 数值 = 29500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 68, new 建筑配置() { 等级 = 68, 数值 = 31500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 69, new 建筑配置() { 等级 = 69, 数值 = 33500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 70, new 建筑配置() { 等级 = 70, 数值 = 35500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 71, new 建筑配置() { 等级 = 71, 数值 = 39500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 72, new 建筑配置() { 等级 = 72, 数值 = 43500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 73, new 建筑配置() { 等级 = 73, 数值 = 47500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 74, new 建筑配置() { 等级 = 74, 数值 = 51500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 75, new 建筑配置() { 等级 = 75, 数值 = 55500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 76, new 建筑配置() { 等级 = 76, 数值 = 59500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 77, new 建筑配置() { 等级 = 77, 数值 = 63500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 78, new 建筑配置() { 等级 = 78, 数值 = 67500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 79, new 建筑配置() { 等级 = 79, 数值 = 71500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 80, new 建筑配置() { 等级 = 80, 数值 = 75500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 81, new 建筑配置() { 等级 = 81, 数值 = 85500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 82, new 建筑配置() { 等级 = 82, 数值 = 95500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 83, new 建筑配置() { 等级 = 83, 数值 = 105500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 84, new 建筑配置() { 等级 = 84, 数值 = 115500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 85, new 建筑配置() { 等级 = 85, 数值 = 125500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 86, new 建筑配置() { 等级 = 86, 数值 = 135500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 87, new 建筑配置() { 等级 = 87, 数值 = 145500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 88, new 建筑配置() { 等级 = 88, 数值 = 155500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 89, new 建筑配置() { 等级 = 89, 数值 = 165500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 90, new 建筑配置() { 等级 = 90, 数值 = 175500, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 91, new 建筑配置() { 等级 = 91, 数值 = 210000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 92, new 建筑配置() { 等级 = 92, 数值 = 240000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 93, new 建筑配置() { 等级 = 93, 数值 = 270000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 94, new 建筑配置() { 等级 = 94, 数值 = 300000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 95, new 建筑配置() { 等级 = 95, 数值 = 330000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 96, new 建筑配置() { 等级 = 96, 数值 = 360000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 97, new 建筑配置() { 等级 = 97, 数值 = 390000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 98, new 建筑配置() { 等级 = 98, 数值 = 420000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 99, new 建筑配置() { 等级 = 99, 数值 = 450000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 100, new 建筑配置() { 等级 = 100, 数值 = 480000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 101, new 建筑配置() { 等级 = 101, 数值 = 580000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 102, new 建筑配置() { 等级 = 102, 数值 = 680000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 103, new 建筑配置() { 等级 = 103, 数值 = 780000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 104, new 建筑配置() { 等级 = 104, 数值 = 880000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 105, new 建筑配置() { 等级 = 105, 数值 = 980000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 106, new 建筑配置() { 等级 = 106, 数值 = 1080000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 107, new 建筑配置() { 等级 = 107, 数值 = 1180000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 108, new 建筑配置() { 等级 = 108, 数值 = 1280000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 109, new 建筑配置() { 等级 = 109, 数值 = 1380000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 110, new 建筑配置() { 等级 = 110, 数值 = 1700000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 111, new 建筑配置() { 等级 = 111, 数值 = 2000000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 112, new 建筑配置() { 等级 = 112, 数值 = 2300000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 113, new 建筑配置() { 等级 = 113, 数值 = 2600000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 114, new 建筑配置() { 等级 = 114, 数值 = 2900000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 115, new 建筑配置() { 等级 = 115, 数值 = 3200000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 116, new 建筑配置() { 等级 = 116, 数值 = 3500000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 117, new 建筑配置() { 等级 = 117, 数值 = 3800000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 118, new 建筑配置() { 等级 = 118, 数值 = 4100000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 119, new 建筑配置() { 等级 = 119, 数值 = 4400000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 120, new 建筑配置() { 等级 = 120, 数值 = 4700000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
    };
     
     public static Dictionary<int, 建筑配置> 地脉配置 = new Dictionary<int, 建筑配置>()
    {
        { 1, new 建筑配置() { 等级 = 1, 数值 = 100, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 2, new 建筑配置() { 等级 = 2, 数值 = 120, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 3, new 建筑配置() { 等级 = 3, 数值 = 140, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 4, new 建筑配置() { 等级 = 4, 数值 = 160, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 5, new 建筑配置() { 等级 = 5, 数值 = 180, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 6, new 建筑配置() { 等级 = 6, 数值 = 200, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 7, new 建筑配置() { 等级 = 7, 数值 = 220, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 8, new 建筑配置() { 等级 = 8, 数值 = 240, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 9, new 建筑配置() { 等级 = 9, 数值 = 260, 升级需要灵气 = 300, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 10, new 建筑配置() { 等级 = 10, 数值 = 280, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 11, new 建筑配置() { 等级 = 11, 数值 = 320, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 12, new 建筑配置() { 等级 = 12, 数值 = 360, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 13, new 建筑配置() { 等级 = 13, 数值 = 400, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 14, new 建筑配置() { 等级 = 14, 数值 = 440, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 15, new 建筑配置() { 等级 = 15, 数值 = 480, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 16, new 建筑配置() { 等级 = 16, 数值 = 520, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 17, new 建筑配置() { 等级 = 17, 数值 = 560, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 18, new 建筑配置() { 等级 = 18, 数值 = 600, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 19, new 建筑配置() { 等级 = 19, 数值 = 640, 升级需要灵气 = 1000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 20, new 建筑配置() { 等级 = 20, 数值 = 680, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 21, new 建筑配置() { 等级 = 21, 数值 = 760, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 22, new 建筑配置() { 等级 = 22, 数值 = 840, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 23, new 建筑配置() { 等级 = 23, 数值 = 920, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 24, new 建筑配置() { 等级 = 24, 数值 = 1000, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 25, new 建筑配置() { 等级 = 25, 数值 = 1080, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 26, new 建筑配置() { 等级 = 26, 数值 = 1160, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 27, new 建筑配置() { 等级 = 27, 数值 = 1240, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 28, new 建筑配置() { 等级 = 28, 数值 = 1320, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 29, new 建筑配置() { 等级 = 29, 数值 = 1400, 升级需要灵气 = 2000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 30, new 建筑配置() { 等级 = 30, 数值 = 1480, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 31, new 建筑配置() { 等级 = 31, 数值 = 1700, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 32, new 建筑配置() { 等级 = 32, 数值 = 1900, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 33, new 建筑配置() { 等级 = 33, 数值 = 2100, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 34, new 建筑配置() { 等级 = 34, 数值 = 2300, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 35, new 建筑配置() { 等级 = 35, 数值 = 2500, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 36, new 建筑配置() { 等级 = 36, 数值 = 2700, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 37, new 建筑配置() { 等级 = 37, 数值 = 2900, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 38, new 建筑配置() { 等级 = 38, 数值 = 3100, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 39, new 建筑配置() { 等级 = 39, 数值 = 3300, 升级需要灵气 = 5000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 40, new 建筑配置() { 等级 = 40, 数值 = 3500, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 41, new 建筑配置() { 等级 = 41, 数值 = 3900, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 42, new 建筑配置() { 等级 = 42, 数值 = 4300, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 43, new 建筑配置() { 等级 = 43, 数值 = 4700, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 44, new 建筑配置() { 等级 = 44, 数值 = 5100, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 45, new 建筑配置() { 等级 = 45, 数值 = 5500, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 46, new 建筑配置() { 等级 = 46, 数值 = 5900, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 47, new 建筑配置() { 等级 = 47, 数值 = 6300, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 48, new 建筑配置() { 等级 = 48, 数值 = 6700, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 49, new 建筑配置() { 等级 = 49, 数值 = 7100, 升级需要灵气 = 10000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 50, new 建筑配置() { 等级 = 50, 数值 = 7500, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 51, new 建筑配置() { 等级 = 51, 数值 = 8300, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 52, new 建筑配置() { 等级 = 52, 数值 = 9100, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 53, new 建筑配置() { 等级 = 53, 数值 = 9900, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 54, new 建筑配置() { 等级 = 54, 数值 = 10700, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 55, new 建筑配置() { 等级 = 55, 数值 = 11500, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 56, new 建筑配置() { 等级 = 56, 数值 = 12300, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 57, new 建筑配置() { 等级 = 57, 数值 = 13100, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 58, new 建筑配置() { 等级 = 58, 数值 = 13900, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 59, new 建筑配置() { 等级 = 59, 数值 = 14700, 升级需要灵气 = 20000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 60, new 建筑配置() { 等级 = 60, 数值 = 15500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 61, new 建筑配置() { 等级 = 61, 数值 = 17500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 62, new 建筑配置() { 等级 = 62, 数值 = 19500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 63, new 建筑配置() { 等级 = 63, 数值 = 21500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 64, new 建筑配置() { 等级 = 64, 数值 = 23500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 65, new 建筑配置() { 等级 = 65, 数值 = 25500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 66, new 建筑配置() { 等级 = 66, 数值 = 27500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 67, new 建筑配置() { 等级 = 67, 数值 = 29500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 68, new 建筑配置() { 等级 = 68, 数值 = 31500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 69, new 建筑配置() { 等级 = 69, 数值 = 33500, 升级需要灵气 = 50000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 70, new 建筑配置() { 等级 = 70, 数值 = 35500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 71, new 建筑配置() { 等级 = 71, 数值 = 39500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 72, new 建筑配置() { 等级 = 72, 数值 = 43500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 73, new 建筑配置() { 等级 = 73, 数值 = 47500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 74, new 建筑配置() { 等级 = 74, 数值 = 51500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 75, new 建筑配置() { 等级 = 75, 数值 = 55500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 76, new 建筑配置() { 等级 = 76, 数值 = 59500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 77, new 建筑配置() { 等级 = 77, 数值 = 63500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 78, new 建筑配置() { 等级 = 78, 数值 = 67500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 79, new 建筑配置() { 等级 = 79, 数值 = 71500, 升级需要灵气 = 100000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 80, new 建筑配置() { 等级 = 80, 数值 = 75500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 81, new 建筑配置() { 等级 = 81, 数值 = 85500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 82, new 建筑配置() { 等级 = 82, 数值 = 95500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 83, new 建筑配置() { 等级 = 83, 数值 = 105500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 84, new 建筑配置() { 等级 = 84, 数值 = 115500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 85, new 建筑配置() { 等级 = 85, 数值 = 125500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 86, new 建筑配置() { 等级 = 86, 数值 = 135500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 87, new 建筑配置() { 等级 = 87, 数值 = 145500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 88, new 建筑配置() { 等级 = 88, 数值 = 155500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 89, new 建筑配置() { 等级 = 89, 数值 = 165500, 升级需要灵气 = 300000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 90, new 建筑配置() { 等级 = 90, 数值 = 175500, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 91, new 建筑配置() { 等级 = 91, 数值 = 210000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 92, new 建筑配置() { 等级 = 92, 数值 = 240000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 93, new 建筑配置() { 等级 = 93, 数值 = 270000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 94, new 建筑配置() { 等级 = 94, 数值 = 300000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 95, new 建筑配置() { 等级 = 95, 数值 = 330000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 96, new 建筑配置() { 等级 = 96, 数值 = 360000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 97, new 建筑配置() { 等级 = 97, 数值 = 390000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 98, new 建筑配置() { 等级 = 98, 数值 = 420000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 99, new 建筑配置() { 等级 = 99, 数值 = 450000, 升级需要灵气 = 1000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 100, new 建筑配置() { 等级 = 100, 数值 = 480000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 101, new 建筑配置() { 等级 = 101, 数值 = 580000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 102, new 建筑配置() { 等级 = 102, 数值 = 680000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 103, new 建筑配置() { 等级 = 103, 数值 = 780000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 104, new 建筑配置() { 等级 = 104, 数值 = 880000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 105, new 建筑配置() { 等级 = 105, 数值 = 980000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 106, new 建筑配置() { 等级 = 106, 数值 = 1080000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 107, new 建筑配置() { 等级 = 107, 数值 = 1180000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 108, new 建筑配置() { 等级 = 108, 数值 = 1280000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 109, new 建筑配置() { 等级 = 109, 数值 = 1380000, 升级需要灵气 = 3000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 110, new 建筑配置() { 等级 = 110, 数值 = 1700000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 111, new 建筑配置() { 等级 = 111, 数值 = 2000000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 112, new 建筑配置() { 等级 = 112, 数值 = 2300000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 113, new 建筑配置() { 等级 = 113, 数值 = 2600000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 114, new 建筑配置() { 等级 = 114, 数值 = 2900000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 115, new 建筑配置() { 等级 = 115, 数值 = 3200000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 116, new 建筑配置() { 等级 = 116, 数值 = 3500000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 117, new 建筑配置() { 等级 = 117, 数值 = 3800000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 118, new 建筑配置() { 等级 = 118, 数值 = 4100000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 119, new 建筑配置() { 等级 = 119, 数值 = 4400000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
        { 120, new 建筑配置() { 等级 = 120, 数值 = 4700000, 升级需要灵气 = 10000000, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 0 } },
    };
     
     
     public static Dictionary<int, 建筑配置> 功德碑配置 = new Dictionary<int, 建筑配置>()
    {
        { 1, new 建筑配置() { 等级 = 1, 数值 = 1000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 2, new 建筑配置() { 等级 = 2, 数值 = 1200, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 3, new 建筑配置() { 等级 = 3, 数值 = 1400, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 4, new 建筑配置() { 等级 = 4, 数值 = 1600, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 5, new 建筑配置() { 等级 = 5, 数值 = 1800, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 6, new 建筑配置() { 等级 = 6, 数值 = 2000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 7, new 建筑配置() { 等级 = 7, 数值 = 2200, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 8, new 建筑配置() { 等级 = 8, 数值 = 2400, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 9, new 建筑配置() { 等级 = 9, 数值 = 2600, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100 } },
        { 10, new 建筑配置() { 等级 = 10, 数值 = 2800, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 11, new 建筑配置() { 等级 = 11, 数值 = 3200, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 12, new 建筑配置() { 等级 = 12, 数值 = 3600, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 13, new 建筑配置() { 等级 = 13, 数值 = 4000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 14, new 建筑配置() { 等级 = 14, 数值 = 4400, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 15, new 建筑配置() { 等级 = 15, 数值 = 4800, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 16, new 建筑配置() { 等级 = 16, 数值 = 5200, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 17, new 建筑配置() { 等级 = 17, 数值 = 5600, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 }},
        { 18, new 建筑配置() { 等级 = 18, 数值 = 6000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 19, new 建筑配置() { 等级 = 19, 数值 = 6400, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300 } },
        { 20, new 建筑配置() { 等级 = 20, 数值 = 6800, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 21, new 建筑配置() { 等级 = 21, 数值 = 7600, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 22, new 建筑配置() { 等级 = 22, 数值 = 8400, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 23, new 建筑配置() { 等级 = 23, 数值 = 9200, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 24, new 建筑配置() { 等级 = 24, 数值 = 10000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 25, new 建筑配置() { 等级 = 25, 数值 = 10800, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 26, new 建筑配置() { 等级 = 26, 数值 = 11600, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 27, new 建筑配置() { 等级 = 27, 数值 = 12400, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 28, new 建筑配置() { 等级 = 28, 数值 = 13200, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 29, new 建筑配置() { 等级 = 29, 数值 = 14000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000 } },
        { 30, new 建筑配置() { 等级 = 30, 数值 = 14800, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 31, new 建筑配置() { 等级 = 31, 数值 = 17000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 32, new 建筑配置() { 等级 = 32, 数值 = 19000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 33, new 建筑配置() { 等级 = 33, 数值 = 21000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 34, new 建筑配置() { 等级 = 34, 数值 = 23000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 35, new 建筑配置() { 等级 = 35, 数值 = 25000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 36, new 建筑配置() { 等级 = 36, 数值 = 27000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 37, new 建筑配置() { 等级 = 37, 数值 = 29000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 }},
        { 38, new 建筑配置() { 等级 = 38, 数值 = 31000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 39, new 建筑配置() { 等级 = 39, 数值 = 33000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 3000 } },
        { 40, new 建筑配置() { 等级 = 40, 数值 = 35000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 41, new 建筑配置() { 等级 = 41, 数值 = 39000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 42, new 建筑配置() { 等级 = 42, 数值 = 43000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 43, new 建筑配置() { 等级 = 43, 数值 = 47000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 44, new 建筑配置() { 等级 = 44, 数值 = 51000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 45, new 建筑配置() { 等级 = 45, 数值 = 55000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 46, new 建筑配置() { 等级 = 46, 数值 = 59000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 47, new 建筑配置() { 等级 = 47, 数值 = 63000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 48, new 建筑配置() { 等级 = 48, 数值 = 67000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 49, new 建筑配置() { 等级 = 49, 数值 = 71000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000 } },
        { 50, new 建筑配置() { 等级 = 50, 数值 = 75000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 51, new 建筑配置() { 等级 = 51, 数值 = 83000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 52, new 建筑配置() { 等级 = 52, 数值 = 91000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 53, new 建筑配置() { 等级 = 53, 数值 = 99000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 54, new 建筑配置() { 等级 = 54, 数值 = 107000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 55, new 建筑配置() { 等级 = 55, 数值 = 115000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 56, new 建筑配置() { 等级 = 56, 数值 = 123000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 57, new 建筑配置() { 等级 = 57, 数值 = 131000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 58, new 建筑配置() { 等级 = 58, 数值 = 139000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 59, new 建筑配置() { 等级 = 59, 数值 = 147000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 30000 } },
        { 60, new 建筑配置() { 等级 = 60, 数值 = 155000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 61, new 建筑配置() { 等级 = 61, 数值 = 175000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 62, new 建筑配置() { 等级 = 62, 数值 = 195000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 63, new 建筑配置() { 等级 = 63, 数值 = 215000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 64, new 建筑配置() { 等级 = 64, 数值 = 235000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 65, new 建筑配置() { 等级 = 65, 数值 = 255000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 66, new 建筑配置() { 等级 = 66, 数值 = 275000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 67, new 建筑配置() { 等级 = 67, 数值 = 295000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 68, new 建筑配置() { 等级 = 68, 数值 = 315000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 69, new 建筑配置() { 等级 = 69, 数值 = 335000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000 } },
        { 70, new 建筑配置() { 等级 = 70, 数值 = 355000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 71, new 建筑配置() { 等级 = 71, 数值 = 395000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 72, new 建筑配置() { 等级 = 72, 数值 = 435000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 73, new 建筑配置() { 等级 = 73, 数值 = 475000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 74, new 建筑配置() { 等级 = 74, 数值 = 515000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 75, new 建筑配置() { 等级 = 75, 数值 = 555000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 76, new 建筑配置() { 等级 = 76, 数值 = 595000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 77, new 建筑配置() { 等级 = 77, 数值 = 635000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 78, new 建筑配置() { 等级 = 78, 数值 = 675000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 79, new 建筑配置() { 等级 = 79, 数值 = 715000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 300000 } },
        { 80, new 建筑配置() { 等级 = 80, 数值 = 755000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 81, new 建筑配置() { 等级 = 81, 数值 = 855000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 82, new 建筑配置() { 等级 = 82, 数值 = 955000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 83, new 建筑配置() { 等级 = 83, 数值 = 1055000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 84, new 建筑配置() { 等级 = 84, 数值 = 1155000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 85, new 建筑配置() { 等级 = 85, 数值 = 1255000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 86, new 建筑配置() { 等级 = 86, 数值 = 1355000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 87, new 建筑配置() { 等级 = 87, 数值 = 1455000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 88, new 建筑配置() { 等级 = 88, 数值 = 1555000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 89, new 建筑配置() { 等级 = 89, 数值 = 1655000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1500000 } },
        { 90, new 建筑配置() { 等级 = 90, 数值 = 1755000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 91, new 建筑配置() { 等级 = 91, 数值 = 2100000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 92, new 建筑配置() { 等级 = 92, 数值 = 2400000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 93, new 建筑配置() { 等级 = 93, 数值 = 2700000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 94, new 建筑配置() { 等级 = 94, 数值 = 3000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 95, new 建筑配置() { 等级 = 95, 数值 = 3300000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 96, new 建筑配置() { 等级 = 96, 数值 = 3600000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 97, new 建筑配置() { 等级 = 97, 数值 = 3900000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 98, new 建筑配置() { 等级 = 98, 数值 = 4200000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 99, new 建筑配置() { 等级 = 99, 数值 = 4500000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000 } },
        { 100, new 建筑配置() { 等级 = 100, 数值 = 4800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 101, new 建筑配置() { 等级 = 101, 数值 = 5800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 102, new 建筑配置() { 等级 = 102, 数值 = 6800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 103, new 建筑配置() { 等级 = 103, 数值 = 7800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 104, new 建筑配置() { 等级 = 104, 数值 = 8800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 105, new 建筑配置() { 等级 = 105, 数值 = 9800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 106, new 建筑配置() { 等级 = 106, 数值 = 10800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 107, new 建筑配置() { 等级 = 107, 数值 = 11800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 108, new 建筑配置() { 等级 = 108, 数值 = 12800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 100000000 } },
        { 109, new 建筑配置() { 等级 = 109, 数值 = 13800000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 1000000000 } },
        { 110, new 建筑配置() { 等级 = 110, 数值 = 17000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 111, new 建筑配置() { 等级 = 111, 数值 = 20000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 112, new 建筑配置() { 等级 = 112, 数值 = 23000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 113, new 建筑配置() { 等级 = 113, 数值 = 26000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 114, new 建筑配置() { 等级 = 114, 数值 = 29000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 115, new 建筑配置() { 等级 = 115, 数值 = 32000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 116, new 建筑配置() { 等级 = 116, 数值 = 35000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 117, new 建筑配置() { 等级 = 117, 数值 = 38000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 118, new 建筑配置() { 等级 = 118, 数值 = 41000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 119, new 建筑配置() { 等级 = 119, 数值 = 44000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
        { 120, new 建筑配置() { 等级 = 120, 数值 = 47000000, 升级需要灵气 = 0, 升级需要矿石 = 0, 升级需要玄铁 = 0, 升级需要玉髓 = 10000000000 } },
    };
}
